---
kind: property
id: P:Autodesk.Revit.DB.SiteLocation.WeatherStationName
source: html/03e4b6e9-9ae0-5b00-3b55-a14ad8323ebb.htm
---
# Autodesk.Revit.DB.SiteLocation.WeatherStationName Property

The name of the weather station at the site location.

## Syntax (C#)
```csharp
public string WeatherStationName { get; }
```